# PointCloudFilterFactory Methods

---
The PointCloudFilterFactory type exposes the following members.
| Name| Description
---|---|---
| CreateMultiPlaneFilter(IListPlane)|
| CreateMultiPlaneFilter(IListPlane, Int32)|
Top
#### Reference
PointCloudFilterFactory Class
Autodesk.Revit.DB.PointClouds Namespace